# 과제2 - WEEK5

과제2는 week4의 stage2를 복사해서 일부를 수정하면 효율적입니다.

---

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/train.csv')
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [2]:
df[['Pclass', 'Sex', 'Embarked']].head()

   Pclass     Sex Embarked
0       3    male        S
1       1  female        C
2       3  female        S
3       1  female        S
4       3    male        S

---

## 특징 생성

In [3]:
# 테스트셋
df_test = pd.read_csv('data/test.csv')
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Age

In [4]:
# 쉬운 방법) 전체 나이 평균을 넣기
df['Age'] = df['Age'].fillna(df['Age'].mean())
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C

In [5]:
# 테스트셋에도 똑같이 적용해야함
df_test['Age'] = df_test['Age'].fillna(df_test['Age'].mean());
# 마지막에 ; 을 뒤에 붙이면 out에 결과표시 생략

## Fare
**운임(Fare)의 빈칸(NaN) 채우기 부분이 개선되었습니다.**

In [6]:
# 운임도 빈칸(NaN)이 있으면 채우기
# df['Fare'] = df['Fare'].fillna(df['Fare'].mean()) # 기존
df['Fare'] = df['Fare'].fillna( df.groupby('Pclass')['Fare'].transform('mean') )

# df_test['Fare'] = df_test['Fare'].fillna(df_test['Fare'].mean()) # 기존
df_test['Fare'] = df_test['Fare'].fillna( df_test.groupby('Pclass')['Fare'].transform('mean') )

# print(df.isnull().sum())
print(df_test.isnull().sum())

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

## FamilySize

In [7]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [8]:
# 테스트셋도 똑같이 적용
df_test['FamilySize'] = df_test['SibSp'] + df_test['Parch']

## IsAlone

In [9]:
df['IsAlone'] = 1
df.loc[ df['FamilySize'] > 0, 'IsAlone'] = 0

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,1

In [10]:
# 테스트셋도 똑같이 적용
df_test['IsAlone'] = 1
df_test.loc[ df_test['FamilySize'] > 0, 'IsAlone'] = 0

## Cabin

In [11]:
df['Cabin'] = df['Cabin'].str[0]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,1

In [12]:
df['Cabin'].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: Cabin, dtype: int64

In [13]:
df['Cabin'] = df['Cabin'].fillna('C')

# 테스트셋에도 똑같이 적용
df_test['Cabin'] = df_test['Cabin'].str[0]
df_test['Cabin'] = df_test['Cabin'].fillna('C')

df_test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
FamilySize     0
IsAlone        0
dtype: int64

## Embarked

In [14]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [15]:
df['Embarked'] = df['Embarked'].fillna('S')
df_test['Embarked'] = df_test['Embarked'].fillna('S')

df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
FamilySize     0
IsAlone        0
dtype: int64

## Features to Numeric

### cabin

In [16]:
df['Cabin'].value_counts()

C    746
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [17]:
# training set
df['Cabin'] = df['Cabin'].map({
    'C': 0,
    'B': 1,
    'D': 2,
    'E': 3,
    'A': 4,
    'F': 5,
    'G': 6,
    'T': 7
})

df['Cabin'].value_counts()

0    746
1     47
2     33
3     32
4     15
5     13
6      4
7      1
Name: Cabin, dtype: int64

In [18]:
# 테스트셋도 똑같이 적용
df_test['Cabin'] = df_test['Cabin'].map({
    'C': 0,
    'B': 1,
    'D': 2,
    'E': 3,
    'A': 4,
    'F': 5,
    'G': 6,
    'T': 7
})

df_test['Cabin'].value_counts()

0    362
1     18
2     13
3      9
5      8
4      7
6      1
Name: Cabin, dtype: int64

### embarked

In [19]:
df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [20]:
# training set
df['Embarked'] = df['Embarked'].map({
    'S': 0,
    'C': 1,
    'Q': 2
});

# 테스트셋도 똑같이 적용
df_test['Embarked'] = df_test['Embarked'].map({
    'S': 0,
    'C': 1,
    'Q': 2
});

df['Embarked'].value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

### sex

In [21]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [22]:
# training set
df['Sex'] = df['Sex'].map({
    'male': 0,
    'female': 1
});

# 테스트셋도 똑같이 적용
df_test['Sex'] = df_test['Sex'].map({
    'male': 0,
    'female': 1
});

---

## 특징 추출

In [23]:
# 더이상 필요 없는 열 삭제
train = df.drop(['Name', 'Ticket', 'SibSp', 'Parch', 'PassengerId'], axis=1)
test = df_test.drop(['Name', 'Ticket', 'SibSp', 'Parch', 'PassengerId'], axis=1)

train.head()

   Survived  Pclass  Sex   Age     Fare  Cabin  Embarked  FamilySize  IsAlone
0         0       3    0  22.0   7.2500      0         0           1        0
1         1       1    1  38.0  71.2833      0         1           1        0
2         1       3    1  26.0   7.9250      0         0           0        1
3         1       1    1  35.0  53.1000      0         0           1        0
4         0       3    0  35.0   8.0500      0         0           0        1

## Modeling

In [24]:
from sklearn.model_selection import train_test_split

train_data = train.drop('Survived', axis=1)
target_data = train['Survived']

#자동으로 75%, 25%로 나눠줍니다.
x_train, x_valid, y_train, y_valid = train_test_split(train_data, target_data) 

print(train_data.shape, x_train.shape, x_valid.shape)

(891, 8) (668, 8) (223, 8)

---

## Random Forest

### 이 부분의 파라미터를 변경하면서 valid score를 확인하고 Kaggle에도 제출해봅니다.

In [25]:
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import PolynomialFeatures
from sklearn.pipeline import make_pipeline

model = make_pipeline(PolynomialFeatures(2), LinearRegression()).fit(x_train, y_train)

print("train set score: {:.2f}".format(model.score(x_train, y_train)))
print("test set score: {:.2f}".format(model.score(x_valid, y_valid)))

train set score: 0.47
test set score: 0.41

---
## Test

In [26]:
prediction = model.predict(test)
prediction

array([ 0.08429672,  0.2901986 , -0.20072227,  0.09037283,  0.32837292,
        0.15471928,  0.68153238,  0.34165435,  0.68915082,  0.16988404,
        0.07520437,  0.25351893,  0.99650645, -0.0928721 ,  0.82837732,
        0.88576751, -0.02286498,  0.23637996,  0.36893442,  0.73175892,
        0.04677404,  0.33234793,  1.16588782,  0.49053744,  1.00425167,
       -0.08635589,  1.20895254,  0.22617346,  0.41643355,  0.18618619,
        0.01123926,  0.3662826 ,  0.24256385,  0.25897461,  0.3622857 ,
        0.25426064,  0.53532001,  0.51228516,  0.1022276 ,  0.35370365,
        0.13841279,  0.48226561,  0.05086086,  0.80603646,  0.94022467,
        0.09434848,  0.61188649,  0.11390456,  1.25317546,  0.28682178,
        0.44188325,  0.20050085,  0.88061335,  0.78074936,  0.17751798,
        0.1183014 ,  0.06218818,  0.32532406,  0.1074836 ,  1.04594364,
        0.13205292,  0.14336347,  0.1260677 ,  0.69390297,  0.28200408,
        0.81615657,  0.70464822,  0.22423703,  0.2575675 ,  1.18591862,
        0.69005856,  0.11176801,  0.53024996,  0.57937757,  1.00787785,
        0.06910693,  0.07602836,  1.20314324,  0.15238912,  0.69005856,
        0.5133793 ,  0.21105477,  0.243561  ,  0.07520437,  0.0166882 ,
        0.25366575,  0.68608217,  0.50417222,  0.68200789,  0.6987197 ,
        0.42459458,  0.07455913,  1.47375344,  0.07602836,  0.31676568,
        0.0937039 ,  0.96936946,  0.07951071,  0.50660118,  0.06808339,
        1.00613177,  0.26580746,  0.11390456,  0.0896257 ,  0.55965719,
        0.16045264,  0.19089945,  0.11390456,  0.07957282,  0.37591496,
        0.11160598,  0.68217437,  1.17634334,  0.70032931,  1.08142287,
        0.42899186,  0.1750541 ,  0.17647449,  0.13421646,  0.71358328,
        0.80255977,  0.19510747,  1.0538866 ,  0.07946504,  0.11390456,
        0.46500429,  0.10664293,  0.52041394,  0.10448523,  0.09909838,
        0.07084959,  0.12032558,  0.20261249,  0.21127539,  0.04881497,
        0.09813435,  0.2008259 ,  0.1737964 ,  0.51377173, -0.11882881,
        0.11515067,  0.97140313,  0.38874009,  0.17768212,  0.26805726,
       -0.01784911,  0.40239288,  0.10786037,  0.32920511,  0.29295312,
        1.08170345,  0.18313105,  0.09126674,  0.27005683,  0.07605318,
        0.09663781,  0.90750328,  0.51283152,  0.42735595,  0.31413539,
        0.68191268,  0.49673914,  0.80097039,  0.07042507,  0.10754233,
        0.34633676,  0.2828721 ,  0.10134724,  1.17115234,  0.51584065,
        0.07335793,  0.19784868,  0.18154598,  0.1794348 , -0.13028598,
        0.84245382,  0.81269572,  0.06047615,  0.69831894,  1.19244759,
        0.15238912,  0.78724603,  1.08296843,  0.11390456,  0.85623656,
        0.11638396,  0.76474996,  0.1633757 ,  0.04498339,  0.11076942,
        0.17881138,  0.33075531,  0.25703149, -0.1868487 ,  0.58797841,
        0.06700145,  0.91527226,  0.50294387,  0.18991142,  0.53565067,
        0.72667078,  0.42027289,  0.1478129 ,  0.91159135,  0.17751339,
        0.27077198,  0.68035998,  0.18362742,  1.19089953,  0.09420277,
        0.15156231,  0.0706915 ,  0.27980096,  0.61058678,  0.11132447,
        0.33078648,  0.6827446 ,  0.190875  ,  0.97699674,  0.07602836,
        0.8197618 ,  0.11249633,  0.43558309,  0.1112959 ,  1.17985477,
        0.48102893,  0.10215994,  0.68200789,  0.09565763,  0.12537755,
        0.28153405,  1.18293598,  0.17361786,  0.11464834,  0.2136378 ,
        0.11639064,  0.26406791,  0.24339677,  0.84156903,  0.93230793,
        1.18448748,  0.70174312,  0.56673198,  0.07516003,  0.00730837,
        0.41669043,  0.8029822 ,  0.16851014,  0.71358328,  0.59427624,
        1.02221465,  0.1167202 ,  0.24914231,  0.1053909 ,  0.07742817,
        0.07335793,  0.11390456,  0.08361416,  0.79746639,  0.11119772,
        0.04969667,  0.1115716 ,  0.7614687 ,  0.47739072,  0.17542638,
        0.07520437,  0.4095495 ,  0.07335793,  0.53532001,  0.1354727 ,
        0.10136702,  0.11390456,  0.95724442,  0.63279542,  0.17941154,
        0.77408166,  0.16019118,  0.11087247,  0.2222891 ,  0.19636541,
        0.51671687,  0.41236045,  0.68200789,  0.64443269,  0.48680445,
        0.05622733,  0.07175759,  0.46328342,  0.78871469,  0.07602836,
        0.29384012,  0.67767759,  0.1794348 ,  0.50513217,  0.06912719,
        0.09023641,  1.11484642,  0.18618619,  0.28009776,  0.0791385 ,
        0.06934857,  0.51003401,  0.06963396,  0.10211802,  0.68200789,
        1.21737169,  0.39256525,  0.48311726,  0.35977176,  0.33730987,
        0.13019781,  0.22953314,  0.07349136,  0.68080633,  1.17088025,
        0.70685866,  0.17600489,  0.21674724,  0.0862269 ,  0.39177094,
        0.0896257 ,  0.81230256,  0.3384197 ,  0.31289792,  1.04179747,
        0.09854415,  0.78054332,  0.0984191 ,  0.24010154,  0.20438002,
        0.704788  ,  0.64247699,  0.17941154,  0.55982531,  0.08644002,
        0.33246466,  0.14270535,  0.01448694,  0.19791753,  0.1794348 ,
        0.22388114,  0.06828059, -0.08496983,  2.19577231,  0.03008903,
        0.4997895 ,  0.1737964 ,  0.70883399,  0.18591038,  0.81787139,
        1.07604974,  0.17751339,  0.27671258,  0.22001488,  0.40990371,
        0.42698558,  1.14014046,  0.07511569,  0.11390456,  0.39197052,
       -0.03094499,  0.89826262,  0.81787139,  0.09037283,  1.21356587,
        0.04498339,  0.25368769,  0.66935741,  0.98876045,  0.18418057,
        0.34171478,  0.930214  ,  0.40188102,  0.09888095,  0.89776487,
        1.21744428,  0.31562389,  0.20353365,  0.2047929 ,  0.16098772,
        0.11390456,  0.14810566,  0.56977344,  0.45232949,  0.15087979,
        0.81410934,  0.09774457,  0.07902605,  0.19053583,  0.22288427,
        0.26107261,  0.95483495,  0.2544041 ,  0.0860094 , -0.02892156,
        1.11949828,  0.16147764,  1.16061378,  0.10654336,  0.10841433,
        0.93369123,  0.1249479 ,  1.1558544 ,  0.35390081,  0.57034392,
        0.58536554,  0.31165377,  0.1385939 ,  0.68184142,  0.4635718 ,
        0.68200789,  0.84488531,  0.52620836,  0.07602836,  1.04951594,
        0.05119651,  0.07602836,  0.189254  ])

In [27]:
# linear regression의 결과는 연속적인 수로 나옵니다.
# 0.5보다 크면 1(생존), 작으면 0(사망)으로 바꿔줍시다.

prediction[prediction > 0.5] = 1
prediction[prediction <= 0.5] = 0
prediction = prediction.astype(int)

prediction

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0])

## Random Forest의 submit 파일 만들기

In [28]:
submit = pd.DataFrame({
    'PassengerId': df_test['PassengerId'],
    'Survived': prediction
})

submit.to_csv('submit_homework2.csv', index=False)

## submit 파일 확인 후 Kaggle 제출

In [29]:
my_prediction = pd.read_csv('submit_homework2.csv')
my_prediction.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0